Extensions/БИТ_Доработки_НДЭ/DataProcessors/УпаковкаВПаллеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УпаковкаВПаллеты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщееКоличествоКоробов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателяСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СколькоПаллетовСоздать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуемыйСклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяВместимостьПаллетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СколькоВПоследнемПаллетеВместимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Паллеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШКПаллета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СколькоУпакованоКоробов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вместимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолностьюУпакован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МоноПаллет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодМонопаллета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/InformationRegisters/ШтрихкодыМонопаллетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыМонопаллетов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БаркодТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомерМонопаллета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихкодПаллета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВместимостьМонопаллета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШтрихкодМонопаллета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураДляМонопаллета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/InformationRegisters/ШтрихкодыПаллетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыПаллетов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолностьюУпакован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СколькоУпаковано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Вместимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоноПаллет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихкодМонопаллета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШтрихкодПаллета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/InformationRegisters/ДанныеПоКоробам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПоКоробам</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПорядковыйНомерКороба</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БаркодТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШККороба</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/InformationRegisters/УпакованныеКороба.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УпакованныеКороба</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШКПаллета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШККороба</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/InformationRegisters/УпаковкаПродукцииКодыМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УпаковкаПродукцииКодыМаркировки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрихкодУпаковки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерНабора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрихкодКороба</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Отсканировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУпаковки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаУпаковкуСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаУпаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобраноВКороб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКороб</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаКоробСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаКороб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИндексСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиВДокументеОсновании</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/Enums/ТипыУпаковок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыУпаковок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МонотоварнаяУпаковка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/DataProcessors/УпаковкаВПаллеты/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПроизводствоОснование") Тогда
		Объект.ДокументОснование = Параметры.ПроизводствоОснование;
		Объект.ЗаказПокупателяСсылка = Объект.ДокументОснование.ЗаказПокупателя;
		Объект.Контрагент = Объект.ЗаказПокупателяСсылка.Контрагент;
		Если Объект.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("РВБ ООО") Тогда
			Объект.ИспользуемыйСклад = 2;
		ИначеЕсли Объект.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("ИНТЕРНЕТ РЕШЕНИЯ ООО") Тогда 
			Объект.ИспользуемыйСклад = 1;
		Иначе
			ВызватьИсключение("Неверный контрагент в заказе покупателя, необходимо указать РВБ ООО или ИНТЕРНЕТ РЕШЕНИЯ ООО");
		КонецЕсли;
	Иначе
		ВызватьИсключение("Нет основания документа производства или заказа покупателя!");
	КонецЕсли;
	
	Если Параметры.Свойство("ПроизводствоТЧ") Тогда
		//если что то нужно по ТЧ производству
	Иначе
		ВызватьИсключение("Нет строк в документе производства по ТЧ ""Продукция"" ");
	КонецЕсли;
	
	//Объект.ОбщееКоличествоКоробов = ПолучитьОбщееКоличествоКоробовПоДокументу();
	Объект.ОбщееКоличествоКоробов = ПолучитьОбщееКоличествоКоробовПоДокументуВерсияДва();
	Если Объект.ОбщееКоличествоКоробов = 0 Тогда
		ВызватьИсключение("Не созданы штрихкоды коробов в РС ДанныеПоКоробам!");
	КонецЕсли;
	
	//Рассчет вместимости у паллетов
	Объект.БазоваяВместимостьПаллетов = 30;
	Объект.СколькоВПоследнемПаллетеВместимость = 30;
	
	//Рассчет сколько палетов в общем
	Объект.СколькоПаллетовСоздать = Цел(Объект.ОбщееКоличествоКоробов/Объект.БазоваяВместимостьПаллетов);
	ДробнаяЧасть = Объект.ОбщееКоличествоКоробов/Объект.БазоваяВместимостьПаллетов;
	
	Если Объект.СколькоПаллетовСоздать <> ДробнаяЧасть Тогда//если есть дробная часть
		Объект.СколькоВПоследнемПаллетеВместимость = Объект.ОбщееКоличествоКоробов - Объект.СколькоПаллетовСоздать*Объект.БазоваяВместимостьПаллетов;
		Объект.СколькоПаллетовСоздать = Объект.СколькоПаллетовСоздать + 1;
	КонецЕсли;
	
	
	ТаблицаПаллетов = ПолучитьТаблицуВсехПаллетовПоДокументу();
	
	Если ТаблицаПаллетов = 0 ИЛИ ТаблицаПаллетов = Неопределено Тогда
		//создаемНовыеШК - записываем в регистр и в штрихкодыУпаковокИТоваров
		ТаблицаЗначенийШКПаллетов = СоздатьШтрихкодыПаллетов(Объект.СколькоПаллетовСоздать);
		Если ТаблицаЗначенийШКПаллетов = Неопределено Тогда
			ВызватьИсключение("Ошибка: Автоматическое создание паллетов!");
		КонецЕсли;
		ТекстПодсказки = ТекстПодсказки + "Штрихкоды паллетов созданы в количестве " + Строка(ТаблицаЗначенийШКПаллетов.Количество());
		//обновляем список
		ОбновитьДанныеНаСервере();
	Иначе
		//Выводим в ТЧ значения
		Для Каждого СтрокаТаблицы Из ТаблицаПаллетов Цикл
			НоваяСтрока = Объект.Паллеты.Добавить();
			НоваяСтрока.ШКПаллета = СтрокаТаблицы.ШтрихкодПаллета;
			НоваяСтрока.СколькоУпакованоКоробов = СтрокаТаблицы.СколькоУпаковано;
			НоваяСтрока.Вместимость = СтрокаТаблицы.Вместимость;
			НоваяСтрока.ПолностьюУпакован = СтрокаТаблицы.ПолностьюУпакован;
			НоваяСтрока.МоноПаллет = СтрокаТаблицы.МоноПаллет;
			НоваяСтрока.ШтрихкодМонопаллета = СтрокаТаблицы.ШтрихкодМонопаллета;
			НоваяСтрока.ОтветственнаяЗона = СтрокаТаблицы.ОтветственнаяЗона;
		КонецЦикла;
		
	КонецЕсли;
	
	
	
КонецПроцедуры 

&НаСервере
Функция СоздатьШтрихкодыПаллетов(Количество)
	//Автоматическое создание по каждому в ШтрихкодыУпаковокТоваров, после выдергиваем ШК из генератораШтрихкодов и Заполняем РС ШтрихкодыПаллетов
	
	//Формируем таблицу значений для записи в регистр
	ТаблицаЗначенийШКПаллетов = Новый ТаблицаЗначений;
	ТаблицаЗначенийШКПаллетов.Колонки.Добавить("Период");
	ТаблицаЗначенийШКПаллетов.Колонки.Добавить("ДокументОснование");
	ТаблицаЗначенийШКПаллетов.Колонки.Добавить("ШтрихкодПаллета");
	ТаблицаЗначенийШКПаллетов.Колонки.Добавить("Вместимость");
	
	//Если монопаллет - нужно поменять на количество равное количеству монопаллетов
	ТаблицаМонопаллетов = ПолучитьТаблицуВсехМоноПаллетовПоДокументу();
	//ШтрихкодыМонопаллетов.Период КАК Период,
	//ШтрихкодыМонопаллетов.ДокументОснование КАК ДокументОснование,
	//ШтрихкодыМонопаллетов.ШтрихкодМонопаллета КАК ШтрихкодМонопаллета,
	//ШтрихкодыМонопаллетов.НоменклатураДляМонопаллета КАК НоменклатураДляМонопаллета,
	//ШтрихкодыМонопаллетов.БаркодТовара КАК БаркодТовара,
	//ШтрихкодыМонопаллетов.ПорядковыйНомерМонопаллета КАК ПорядковыйНомерМонопаллета,
	//ШтрихкодыМонопаллетов.ШтрихкодПаллета КАК ШтрихкодПаллета,
	//ШтрихкодыМонопаллетов.ВместимостьМонопаллета КАК ВместимостьМонопаллета
	Если Не ТаблицаМонопаллетов = Неопределено Тогда
		Если ТаблицаМонопаллетов.Количество() > 0 Тогда
			
			ПредыдущийШКМонопаллета = 0;
			Количество = ТаблицаМонопаллетов.Количество();
			ВместимостьПаллета = ТаблицаМонопаллетов[0].ВместимостьМонопаллета;;
			Номер = 1;
			
			Пока Номер <> Количество+1 Цикл
				ЭтотШКМонопаллета = ТаблицаМонопаллетов[Номер-1].ШтрихкодМонопаллета;
				Если ПредыдущийШКМонопаллета <> 0 И ЭтотШКМонопаллета = ПредыдущийШКМонопаллета Тогда
					ВместимостьПаллета = ВместимостьПаллета + ТаблицаМонопаллетов[Номер-1].ВместимостьМонопаллета;
					ПредыдущийШКМонопаллета = ТаблицаМонопаллетов[Номер-1].ШтрихкодМонопаллета;
					Номер = Номер+1;
					Продолжить;
				КонецЕсли;
				Если ВместимостьПаллета > 30 Тогда
					ВызватьИсключение("Вместимость паллета больше 30 из-за общей вместимости монопаллета " + ТаблицаМонопаллетов[Номер-1].ШтрихкодМонопаллета);
				КонецЕсли;
				Стр = ТаблицаЗначенийШКПаллетов.Добавить();
				Стр.Период = ТекущаяДата();
				Стр.ДокументОснование = Объект.ДокументОснование;
				Стр.ШтрихкодПаллета = СоздатьЗаписьВШтрихкодыУпаковокИТоваровДляПаллета();
				Стр.Вместимость = ВместимостьПаллета;
				
				ВместимостьПаллета = ТаблицаМонопаллетов[Номер-1].ВместимостьМонопаллета;
				ПредыдущийШКМонопаллета = ТаблицаМонопаллетов[Номер-1].ШтрихкодМонопаллета;
				Номер = Номер+1;
				
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		Номер = 1;
		Пока Номер <> Количество+1 Цикл
			Стр = ТаблицаЗначенийШКПаллетов.Добавить();
			Стр.Период = ТекущаяДата();
			Стр.ДокументОснование = Объект.ДокументОснование;
			Стр.ШтрихкодПаллета = СоздатьЗаписьВШтрихкодыУпаковокИТоваровДляПаллета();
			Стр.Вместимость = Объект.БазоваяВместимостьПаллетов;
			Если Номер = Количество Тогда//если последний паллет, то у него может быть другая вместимость
				Стр.Вместимость = Объект.СколькоВПоследнемПаллетеВместимость;
			КонецЕсли;
			Номер = Номер+1;
		КонецЦикла;
	КонецЕсли;
	
	//если монопаллет - сначала изменяем записи и привязываемся между монопаллетами и паллетами по шк
	Если Не ТаблицаМонопаллетов = Неопределено Тогда
		Если ТаблицаМонопаллетов.Количество() > 0 Тогда
			
			//сначала проверяем количество монопаллетов и обычных паллетов
			ШКМонопаллетов = ТаблицаМонопаллетов.ВыгрузитьКолонку("ШтрихкодМоноПаллета");
			ШКМонопаллетов = СвернутьМассив(ШКМонопаллетов);
			Если ТаблицаЗначенийШКПаллетов.Количество() <> ШКМонопаллетов.Количество() Тогда
				ВызватьИсключение("Количество необходимых паллетов не совпадает с количеством Монопаллетов в заказе покупателя!");
			КонецЕсли;
			
			//Дальше необходимо связать монопаллеты и паллеты путем записи в регистр шк монопаллетов и добавлением колонки по шк паллетам
			ПредыдущийШКМонопаллета = ТаблицаМонопаллетов[0].ШтрихкодМонопаллета;
			Индекс = 0;
			Для Каждого СтрокаМонопаллета Из ТаблицаМонопаллетов Цикл
				
				Если СтрокаМонопаллета.ШтрихкодМонопаллета <> ПредыдущийШКМонопаллета Тогда
					Индекс = Индекс + 1;
					СтрокаМонопаллета.ШтрихкодПаллета = ТаблицаЗначенийШКПаллетов[Индекс].ШтрихкодПаллета;
					ПредыдущийШКМонопаллета = СтрокаМонопаллета.ШтрихкодМонопаллета;
				Иначе
					СтрокаМонопаллета.ШтрихкодПаллета = ТаблицаЗначенийШКПаллетов[Индекс].ШтрихкодПаллета;
					ПредыдущийШКМонопаллета = СтрокаМонопаллета.ШтрихкодМонопаллета;
				КонецЕсли;
				
			КонецЦикла;
			
			//теперь обновляем записи в регистре ШтрихкодыМонопаллетов
			ДокументОснование = ТаблицаМонопаллетов[0].ДокументОснование;//Получаем значения для отбора из первой строки
			НаборЗаписей = РегистрыСведений.ШтрихкодыМонопаллетов.СоздатьНаборЗаписей();// Пакетная запись в регистр
			НаборЗаписей.Отбор.ДокументОснование.Установить(ДокументОснование);//Пакетная запись в регистр (удаляем старые записи по этому документу, записываем новые)
			НаборЗаписей.Прочитать();      // Читаем старые записи по этому отбору
			НаборЗаписей.Загрузить(ТаблицаМонопаллетов);  // Загружаем новые данные
			НаборЗаписей.Записать(Истина); // Истина = замещать старые записи новыми
			
			
			//Добавляем колонки по шк паллетам
			ТаблицаЗначенийШКПаллетов.Колонки.Добавить("МоноПаллет");
			ТаблицаЗначенийШКПаллетов.Колонки.Добавить("ШтрихкодМонопаллета");
			ТаблицаЗначенийШКПаллетов.Колонки.Добавить("ОтветственнаяЗона");
			Индекс = 0;
			Для Каждого СтрокаТаблицы Из ТаблицаЗначенийШКПаллетов Цикл
				
				СтрокаТаблицы.МоноПаллет = Истина;
				ШКМонопаллета = ТаблицаМонопаллетов.Найти(СтрокаТаблицы.ШтрихкодПаллета, "ШтрихкодПаллета");
				СтрокаТаблицы.ШтрихкодМонопаллета = ШКМонопаллета.ШтрихкодМоноПаллета;
				//записываем ответственные зоны
				РазрешеннаяНоменклатура = ПолучитьРазрешеннуюНоменклатуру(СтрокаТаблицы.ШтрихкодМонопаллета, СтрокаТаблицы.ШтрихкодПаллета);
				Если РазрешеннаяНоменклатура = Неопределено Тогда
					ВызватьИсключение("Не найдена номенклатура по монопаллету");
				КонецЕсли;
				Для каждого Строка Из РазрешеннаяНоменклатура Цикл
					ТаблицаОтветственнаяЗонаПоНоменклатуре = НайтиОтветственнуюЗонуПоРазрешеннойНоменклатуре(Строка.НоменклатураДляМонопаллета);
				КонецЦикла;
				Если ТаблицаОтветственнаяЗонаПоНоменклатуре = Неопределено Тогда
					ВызватьИсключение("Не найдена ответственная зона по монопаллету");
				КонецЕсли;
				СтрокаТаблицы.ОтветственнаяЗона = ТаблицаОтветственнаяЗонаПоНоменклатуре[0].ЗонаУпаковки;
				Индекс = Индекс + 1;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	//теперь записываем ТаблицаЗначенийШКПаллетов
	
	//Получаем значения для отбора из первой строки
	ДокументОснование = ТаблицаЗначенийШКПаллетов[0].ДокументОснование;
	
	// Пакетная запись в регистр
	НаборЗаписей = РегистрыСведений.ШтрихкодыПаллетов.СоздатьНаборЗаписей();
	
	//Пакетная запись в регистр (удаляем старые записи по этому документу, записываем новые)
	НаборЗаписей.Отбор.ДокументОснование.Установить(ДокументОснование);
	
	НаборЗаписей.Прочитать();      // Читаем старые записи по этому отбору
	НаборЗаписей.Загрузить(ТаблицаЗначенийШКПаллетов);  // Загружаем новые данные
	НаборЗаписей.Записать(Истина); // Истина = замещать старые записи новыми
	
	ТекстПодсказки = "Данные успешно записаны в регистр ШтрихкодыПаллетов. Записей: " + ТаблицаЗначенийШКПаллетов.Количество() + ". Можно приступать к работе!";
	Возврат ТаблицаЗначенийШКПаллетов;
КонецФункции

&НаСервере
Функция НайтиОтветственнуюЗонуПоРазрешеннойНоменклатуре(НоменклатураДляМонопаллета)
	Если НоменклатураДляМонопаллета = "" Или НоменклатураДляМонопаллета = Неопределено Тогда
		Сообщить("Ошибка: не указана разрешенная номенклатура Монопаллета");
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СборкаЗапасовПродукция.ЗонаУпаковки КАК ЗонаУпаковки
	|ИЗ
	|	Документ.СборкаЗапасов.Продукция КАК СборкаЗапасовПродукция
	|ГДЕ
	|	СборкаЗапасовПродукция.Ссылка = &Ссылка
	|	И СборкаЗапасовПродукция.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ДокументОснование);
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураДляМонопаллета);
	
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
	Исключение
		// Логирование ошибки (опционально)
		// ЗаписьЖурналаРегистрации("Ошибка запроса паллет", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
	//Есть ли данные в результате
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//Выгрузка результата с обработкой ошибок
	Попытка
		ТаблицаРазрешеннойНоменклатуры = РезультатЗапроса.Выгрузить();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ТаблицаРазрешеннойНоменклатуры;
КонецФункции

&НаСервере
Функция СвернутьМассив(ИсходныйМассив)
	уник = Новый Соответствие;
	
	Для Каждого Значение Из ИсходныйМассив Цикл
		уник[Значение] = Истина; // Ключом становится элемент массива
	КонецЦикла;
	
	СвернутыйМассив = Новый Массив;
	Для Каждого КлючЗначение Из уник Цикл
		СвернутыйМассив.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	
	Возврат СвернутыйМассив;
КонецФункции

&НаСервере
Функция СоздатьЗаписьВШтрихкодыУпаковокИТоваровДляПаллета()
	
	// Устанавливаем привилегированный режим внутри функции
	УстановитьПривилегированныйРежим(Истина);
	
	//Генерируем через генератор ШК штрихкод паллета
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("ЦифраРасширения", 1);
	ПараметрыШтрихкода.Вставить("ПрефиксКомпанииGS1", 466060592);
	ПараметрыШтрихкода.Вставить("СерийныйНомерSSCC",  ОпределитьПоследнийСерийныйНомер()+1);
	
	ШКПаллета = ШтрихкодыУпаковокКлиентСервер.ШтрихкодSSCC(ПараметрыШтрихкода);
	
	// Пытаемся найти существующий элемент
	СуществующийЭлемент = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ШКПаллета);

	Если СуществующийЭлемент = Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка() Тогда
		// Элемент не найден — создаем новый
		НовыйЭлемент = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент();
		НовыйЭлемент.ЗначениеШтрихкода = ШКПаллета;
		НовыйЭлемент.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
		НовыйЭлемент.ТипШтрихкода = Перечисления.ТипыШтрихкодов.SSCC;
		НовыйЭлемент.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		НовыйЭлемент.Количество = 1;
		НовыйЭлемент.Записать();
		//Сообщить("Создан новый элемент штрихкода паллета");
		Возврат ШКПаллета;
	Иначе
		// Элемент уже существует
		Сообщить("Элемент штрихкода паллета уже существует (" + ШКПаллета + ")");
		Возврат Неопределено;
	КонецЕсли;
	
	// Восстанавливаем предыдущий режим (опционально)
	 УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПриведенноеКДлинеЗначение(Знач ИсходнаяСтрока, Длина)
	Если ТипЗнч(ИсходнаяСтрока) = Тип("Число") Тогда
		Строка = Формат(ИсходнаяСтрока, "ЧН=0; ЧГ=0");
	Иначе
		Строка = СокрЛП(ИсходнаяСтрока);
	КонецЕсли;
	ТекущаяДлина = СтрДлина(Строка);
	Пока ТекущаяДлина < Длина Цикл
		Строка = "0" + Строка;
		ТекущаяДлина = ТекущаяДлина + 1;
	КонецЦикла;
	
	Возврат Строка;
КонецФункции

&НаСервере
Функция ОпределитьПоследнийСерийныйНомер()
	ПрефиксКомпанииGS1 = 466060592;
	ЦифраРасширения = 1;
	ЧастьШтрихкодаБезСкобок  = "00" + ЦифраРасширения + ПриведенноеКДлинеЗначение(ПрефиксКомпанииGS1, 9);
	ЧастьШтрихкодаСоСкобками = "(00)" + ЦифраРасширения + ПриведенноеКДлинеЗначение(ПрефиксКомпанииGS1, 9);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЧастьШтрихкода", ЧастьШтрихкодаСоСкобками + "%");
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	&ВыражениеСерийныйНомерSSCC КАК СерийныйНомерSSCC
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода ПОДОБНО &ЧастьШтрихкода
	|	И ШтрихкодыУпаковокТоваров.ТипШтрихкода В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.SSCC),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.SSCC18),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.SSCC20))
	|
	|УПОРЯДОЧИТЬ ПО
	|	СерийныйНомерSSCC УБЫВ";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВыражениеСерийныйНомерSSCC", "ПОДСТРОКА(ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода, 15, 7)");
	
	Результат = Запрос.Выполнить();
	ПоследнийНомерВБД = 0;
	
	Если Результат.Пустой() Тогда
		Запрос.Текст = ТекстЗапроса;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВыражениеСерийныйНомерSSCC", "ПОДСТРОКА(ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода, 13, 7)");
		Запрос.УстановитьПараметр("ЧастьШтрихкода", ЧастьШтрихкодаБезСкобок + "%");
		Результат = Запрос.Выполнить();
	КонецЕсли;
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ПоследнийНомерВБД = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Выборка.СерийныйНомерSSCC);
	КонецЕсли;
	Возврат ПоследнийНомерВБД;
	
КонецФункции

&НаСервере
Функция ПолучитьОбщееКоличествоКоробовПоДокументу()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Количество(ДанныеПоКоробам.ШККороба) КАК Количество
	|ИЗ
	|	РегистрСведений.ДанныеПоКоробам КАК ДанныеПоКоробам
	|ГДЕ
	|	ДанныеПоКоробам.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ЗаказПокупателяСсылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Количество;
КонецФункции

&НаСервере
Функция ПолучитьОбщееКоличествоКоробовПоДокументуВерсияДва()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СборкаЗапасовПродукция.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|	СборкаЗапасовПродукция.Количество КАК Количество
	|ИЗ
	|	Документ.СборкаЗапасов.Продукция КАК СборкаЗапасовПродукция
	|ГДЕ
	|	СборкаЗапасовПродукция.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ДокументОснование);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СколькоНеобходимоКоробов = 0;
	Пока Выборка.Следующий() Цикл
		ОбщееКоличествоНоменклатуры = Выборка.Количество;
		КоличествоВОдномКоробеВКарточкеНоменклатуры = ПолучитьЗначениеДопРеквизитаКороб(Выборка.НоменклатураСсылка);
		Если КоличествоВОдномКоробеВКарточкеНоменклатуры = Неопределено ИЛИ КоличествоВОдномКоробеВКарточкеНоменклатуры = 0 Тогда
			ВызватьИсключение("Не задано кол-во коробов в карточке номенклатуры!");
		КонецЕсли;
		НужноКоробов = Цел(ОбщееКоличествоНоменклатуры/КоличествоВОдномКоробеВКарточкеНоменклатуры);
		ДробнаяЧасть = ОбщееКоличествоНоменклатуры/КоличествоВОдномКоробеВКарточкеНоменклатуры;
		Если  НужноКоробов <> ДробнаяЧасть Тогда
			НужноКоробов = НужноКоробов + 1;
		КонецЕсли;
		СколькоНеобходимоКоробов = СколькоНеобходимоКоробов + НужноКоробов;
	КонецЦикла;
	
	Возврат СколькоНеобходимоКоробов;
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеДопРеквизитаКороб(НоменклатураСсылка)
	
	ОбъектНоменклатуры = НоменклатураСсылка.ПолучитьОбъект();
	
	ЭлементПВХ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "КолвоВОтгрузочнойКоробке_46ce489ccc8b43f1a0f2ee82e9be3e64");
	Если ЭлементПВХ.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	СвойствоЗначение = ОбъектНоменклатуры.ДополнительныеРеквизиты.Найти(ЭлементПВХ, "Свойство");
	Если СвойствоЗначение <> Неопределено Тогда
		ЗначениеДопРеквизитаКолвоВКоробке = СвойствоЗначение.Значение; 
	Иначе
		ЗначениеДопРеквизитаКолвоВКоробке = Неопределено;
	КонецЕсли;
	Если ЗначениеДопРеквизитаКолвоВКоробке <> Неопределено Тогда
		Возврат ЗначениеДопРеквизитаКолвоВКоробке;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуВсехПаллетовПоДокументу()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыПаллетов.ШтрихкодПаллета КАК ШтрихкодПаллета,
	|	ШтрихкодыПаллетов.СколькоУпаковано КАК СколькоУпаковано,
	|	ШтрихкодыПаллетов.Вместимость КАК Вместимость,
	|	ШтрихкодыПаллетов.ПолностьюУпакован КАК ПолностьюУпакован,
	|	ШтрихкодыПаллетов.МоноПаллет КАК МоноПаллет,
	|	ШтрихкодыПаллетов.ШтрихкодМонопаллета КАК ШтрихкодМонопаллета,
	|	ШтрихкодыПаллетов.ОтветственнаяЗона КАК ОтветственнаяЗона
	|ИЗ
	|	РегистрСведений.ШтрихкодыПаллетов КАК ШтрихкодыПаллетов
	|ГДЕ
	|	ШтрихкодыПаллетов.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
	
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
	Исключение
		// Логирование ошибки (опционально)
		// ЗаписьЖурналаРегистрации("Ошибка запроса паллет", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
	//Есть ли данные в результате
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//Выгрузка результата с обработкой ошибок
	Попытка
		ТаблицаПаллетов = РезультатЗапроса.Выгрузить();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ТаблицаПаллетов;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуВсехМоноПаллетовПоДокументу()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыМонопаллетов.Период КАК Период,
	|	ШтрихкодыМонопаллетов.ДокументОснование КАК ДокументОснование,
	|	ШтрихкодыМонопаллетов.ШтрихкодМонопаллета КАК ШтрихкодМонопаллета,
	|	ШтрихкодыМонопаллетов.НоменклатураДляМонопаллета КАК НоменклатураДляМонопаллета,
	|	ШтрихкодыМонопаллетов.БаркодТовара КАК БаркодТовара,
	|	ШтрихкодыМонопаллетов.ПорядковыйНомерМонопаллета КАК ПорядковыйНомерМонопаллета,
	|	ШтрихкодыМонопаллетов.ШтрихкодПаллета КАК ШтрихкодПаллета,
	|	ШтрихкодыМонопаллетов.ВместимостьМонопаллета КАК ВместимостьМонопаллета
	|ИЗ
	|	РегистрСведений.ШтрихкодыМонопаллетов КАК ШтрихкодыМонопаллетов
	|ГДЕ
	|	ШтрихкодыМонопаллетов.ДокументОснование = &ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихкодМонопаллета,
	|	ПорядковыйНомерМонопаллета";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ЗаказПокупателяСсылка);
	
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
	Исключение
		// Логирование ошибки (опционально)
		// ЗаписьЖурналаРегистрации("Ошибка запроса паллет", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
	//Есть ли данные в результате
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//Выгрузка результата с обработкой ошибок
	Попытка
		ТаблицаМонопаллетов = РезультатЗапроса.Выгрузить();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ТаблицаМонопаллетов;
	
КонецФункции

&НаСервере
Функция ПолучитьШтрихкодыУпакованныхКоробов()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпакованныеКороба.ШККороба КАК ШККороба
	|ИЗ
	|	РегистрСведений.УпакованныеКороба КАК УпакованныеКороба
	|ГДЕ
	|	УпакованныеКороба.ДокументОснование = &ДокументОснование
	|	И УпакованныеКороба.ШКПаллета = """"";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
	
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
	Исключение
		// Логирование ошибки (опционально)
		// ЗаписьЖурналаРегистрации("Ошибка запроса паллет", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
	//Есть ли данные в результате
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//Выгрузка результата с обработкой ошибок
	Попытка
		ТаблицаУпакованныхКоробов = РезультатЗапроса.Выгрузить();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	МассивШКУпакованныхКоробов = Новый Массив;
	Для каждого СтрокаТаблицы Из ТаблицаУпакованныхКоробов Цикл
		МассивШКУпакованныхКоробов.Добавить(СтрокаТаблицы.ШККороба);
	КонецЦикла;
	Возврат МассивШКУпакованныхКоробов;
	
КонецФункции

Функция ПолучитьШтрихкодыУпакованныхКоробовДляМонопаллета(ШтрихкодМонопаллета, ШКПаллета)
	
	ТаблицаРазрешеннойНоменклатуры = ПолучитьРазрешеннуюНоменклатуру(ШтрихкодМонопаллета, ШКПаллета);
	МассивРазрешеннойНоменклатуры = Новый Массив;
	Для Каждого СтрокаТаблицы Из ТаблицаРазрешеннойНоменклатуры Цикл
		МассивРазрешеннойНоменклатуры.Добавить(СтрокаТаблицы.НоменклатураДляМонопаллета);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпакованныеКороба.ШККороба КАК ШККороба
	|ИЗ
	|	РегистрСведений.УпакованныеКороба КАК УпакованныеКороба
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УпаковкаПродукцииКодыМаркировки КАК УпаковкаПродукцииКодыМаркировки
	|		ПО УпакованныеКороба.ШККороба = УпаковкаПродукцииКодыМаркировки.ШтрихкодКороба
	|ГДЕ
	|	УпакованныеКороба.ДокументОснование = &ДокументОснование
	|	И УпакованныеКороба.ШКПаллета = """"
	|	И УпаковкаПродукцииКодыМаркировки.Номенклатура В(&МассивНоменклатуры)
	|	И УпаковкаПродукцииКодыМаркировки.Тип <> ""ЧастьНабора""";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивРазрешеннойНоменклатуры);
	
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
	Исключение
		// Логирование ошибки (опционально)
		// ЗаписьЖурналаРегистрации("Ошибка запроса паллет", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
	//Есть ли данные в результате
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//Выгрузка результата с обработкой ошибок
	Попытка
		ТаблицаУпакованныхКоробов = РезультатЗапроса.Выгрузить();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	МассивШКУпакованныхКоробов = Новый Массив;
	Для каждого СтрокаТаблицы Из ТаблицаУпакованныхКоробов Цикл
		МассивШКУпакованныхКоробов.Добавить(СтрокаТаблицы.ШККороба);
	КонецЦикла;
	Возврат МассивШКУпакованныхКоробов;
	
КонецФункции

&НаСервере
Функция ПолучитьРазрешеннуюНоменклатуру(ШтрихкодМонопаллета, ШКПаллета)
	
	Если ШтрихкодМонопаллета = "" Или ШтрихкодМонопаллета = Неопределено Тогда
		Сообщить("Ошибка: не указан штрихкод Монопаллета");
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыМонопаллетов.НоменклатураДляМонопаллета КАК НоменклатураДляМонопаллета,
	|	ШтрихкодыМонопаллетов.БаркодТовара КАК БаркодТовара
	|ИЗ
	|	РегистрСведений.ШтрихкодыМонопаллетов КАК ШтрихкодыМонопаллетов
	|ГДЕ
	|	ШтрихкодыМонопаллетов.ДокументОснование = &ДокументОснование
	|	И ШтрихкодыМонопаллетов.ШтрихкодМонопаллета = &ШтрихкодМонопаллета
	|	И ШтрихкодыМонопаллетов.ШтрихкодПаллета = &ШтрихкодПаллета";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ЗаказПокупателяСсылка);
	Запрос.УстановитьПараметр("ШтрихкодМонопаллета", ШтрихкодМонопаллета);
	Запрос.УстановитьПараметр("ШтрихкодПаллета", ШКПаллета);
	
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
	Исключение
		// Логирование ошибки (опционально)
		// ЗаписьЖурналаРегистрации("Ошибка запроса паллет", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
	//Есть ли данные в результате
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//Выгрузка результата с обработкой ошибок
	Попытка
		ТаблицаРазрешеннойНоменклатуры = РезультатЗапроса.Выгрузить();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ТаблицаРазрешеннойНоменклатуры;
	
КонецФункции

#Область Кнопки

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	// Перезагружаем данные из базы
	ОбновитьДанныеНаСервере();
	
	ТекстПодсказки = "Список обновлен";
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеНаСервере()
	
	// Перезаполняем таблицу свежими данными
	Объект.Паллеты.Очистить();
	
	ТаблицаПаллетов = ПолучитьТаблицуВсехПаллетовПоДокументу();
	
	Если ТаблицаПаллетов = 0 Тогда
		ТекстПодсказки = "Ни одного паллета не создано по документу " + Строка(Объект.ДокументОснование.Наименование);
	Иначе
		//Выводим в ТЧ значения
		Для Каждого СтрокаТаблицы Из ТаблицаПаллетов Цикл
			НоваяСтрока = Объект.Паллеты.Добавить();
			НоваяСтрока.ШКПаллета = СтрокаТаблицы.ШтрихкодПаллета;
			НоваяСтрока.СколькоУпакованоКоробов = СтрокаТаблицы.СколькоУпаковано;
			НоваяСтрока.ПолностьюУпакован = СтрокаТаблицы.ПолностьюУпакован;
			НоваяСтрока.Вместимость = СтрокаТаблицы.Вместимость;
			НоваяСтрока.МоноПаллет = СтрокаТаблицы.МоноПаллет;
			НоваяСтрока.ШтрихкодМонопаллета = СтрокаТаблицы.ШтрихкодМонопаллета;
			НоваяСтрока.ОтветственнаяЗона = СтрокаТаблицы.ОтветственнаяЗона;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура НачатьСборкуВПаллет(Команда)
	
	// 1. Проверяем, что выделена хотя бы одна строка
	Если Не Объект.Паллеты.Количество() > 0 И Не Элементы.Паллеты.ТекущаяСтрока = Неопределено Тогда
		ТекстПодсказки = "Выделите строку паллета для начала работы.";
		Возврат;
	КонецЕсли;
	
	// 2. Получаем данные выделенной строки
	ТекущаяСтрока = Элементы.Паллеты.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока.ПолностьюУпакован Тогда
		
		МассивСвободныхШКУпакованныхКоробов = Новый Массив;
		МассивСвободныхШКУпакованныхКоробов = ПолучитьШтрихкодыУпакованныхКоробов();
		
		Если МассивСвободныхШКУпакованныхКоробов = Неопределено Тогда
			ТекстПодсказки = "Еще не созданы упакованные короба";
			Возврат;
		КонецЕсли;
		
		//Нужно передавать упакованные короба только с нужной номенклатурой
		Если ТекущаяСтрока.МоноПаллет = Истина Тогда
			МассивСвободныхШКУпакованныхКоробов = ПолучитьШтрихкодыУпакованныхКоробовДляМонопаллета(ТекущаяСтрока.ШтрихкодМонопаллета, ТекущаяСтрока.ШКПаллета);
			Если МассивСвободныхШКУпакованныхКоробов = Неопределено Тогда
				ТекстПодсказки = "Еще не созданы упакованные короба для Монопаллета в которых есть Разрешенная номенклатура";
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыДляВводаШККороба = Новый Структура;
		ПараметрыДляВводаШККороба.Вставить("МассивСвободныхШКУпакованныхКоробов", МассивСвободныхШКУпакованныхКоробов);
		ПараметрыДляВводаШККороба.Вставить("СколькоУжеУпакованоВПаллет", ТекущаяСтрока.СколькоУпакованоКоробов);
		ПараметрыДляВводаШККороба.Вставить("ИспользуемыйСклад", Объект.ИспользуемыйСклад);
		ПараметрыДляВводаШККороба.Вставить("ШКПаллета",ТекущаяСтрока.ШКПаллета);
		ПараметрыДляВводаШККороба.Вставить("СколькоВПоследнемПаллетеВместимость",Объект.СколькоВПоследнемПаллетеВместимость);
		ПараметрыДляВводаШККороба.Вставить("ДокументОснование",Объект.ДокументОснование);
		ПараметрыДляВводаШККороба.Вставить("ЗаказПокупателяСсылка",Объект.ЗаказПокупателяСсылка);
		ПараметрыДляВводаШККороба.Вставить("МоноПаллет",ТекущаяСтрока.МоноПаллет);
		ПараметрыДляВводаШККороба.Вставить("ШтрихкодМонопаллета",ТекущаяСтрока.ШтрихкодМонопаллета);
		ПараметрыДляВводаШККороба.Вставить("Вместимость",ТекущаяСтрока.Вместимость);
		
		ПараметрыПослеУдачногоВвода = Новый Структура;
		ПараметрыПослеУдачногоВвода.Вставить("ШКПаллета",ТекущаяСтрока.ШКПаллета);
		ПараметрыПослеУдачногоВвода.Вставить("СколькоУжеУпакованоВПаллет", ТекущаяСтрока.СколькоУпакованоКоробов);
		ПараметрыПослеУдачногоВвода.Вставить("МоноПаллет",ТекущаяСтрока.МоноПаллет);
		ПараметрыПослеУдачногоВвода.Вставить("ШтрихкодМонопаллета",ТекущаяСтрока.ШтрихкодМонопаллета);
		ПараметрыПослеУдачногоВвода.Вставить("Вместимость",ТекущаяСтрока.Вместимость);
		
		//озвучиваем количество номер сколько уже упаковано в короб
		КоличествоУпакованных = ТекущаяСтрока.СколькоУпакованоКоробов;
		ВместимостьПаллета = ПолучитьВместимостьПаллета(ТекущаяСтрока.ШКПаллета);
		//ОзвучитьТекст(Строка(КоличествоУпакованных) + " из " + Строка(ВместимостьПаллета) + " собрано в паллет");
		СтрокаНумерацииУпакованных = Строка(КоличествоУпакованных) + " из " + Строка(ВместимостьПаллета) + " собрано в паллет";
		//Сообщить(Строка(КоличествоУпакованных) + " из " + Строка(ВместимостьПаллета) + " собрано в паллет");
		ПараметрыДляВводаШККороба.Вставить("СтрокаНумерацииУпакованных",СтрокаНумерацииУпакованных);
		
		Оповещение = Новый ОписаниеОповещения("ПослеВводаШККоробаДляПаллета", ЭтотОбъект, ПараметрыПослеУдачногоВвода);
		ОткрытьФорму("Обработка.УпаковкаВПаллеты.Форма.ВводКороба", ПараметрыДляВводаШККороба, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОзвучитьТекст("Паллет собран и готов к отгрузке");
		ТекстПодсказки = "Паллет полностью упакован.";
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаШККоробаДляПаллета(Результат, ПараметрыПослеУдачногоВвода) Экспорт
	/////////////////////////////////////////////////////////
	Если Результат <> Неопределено И Результат <> "" Тогда
		//обновляем РС по УпакованныеКороба
		ОбновитьРСУпакованныеКороба(Результат, ПараметрыПослеУдачногоВвода.ШКПаллета);
		
		//обновляем РС по ШтрихкодыПаллетов
		ОбновитьРСШтрихкодыПаллетов(ПараметрыПослеУдачногоВвода.ШКПаллета, ПараметрыПослеУдачногоВвода.СколькоУжеУпакованоВПаллет+1);
		
		//Обновляем таблицу
		ОбновитьДанныеНаСервере();
		
		//озвучиваем количество номер сколько уже упаковано в короб
		КоличествоУпакованных = ПараметрыПослеУдачногоВвода.СколькоУжеУпакованоВПаллет+1;
		ВместимостьПаллета = ПолучитьВместимостьПаллета(ПараметрыПослеУдачногоВвода.ШКПаллета);
		//ОзвучитьТекст(Строка(КоличествоУпакованных) + " из " + Строка(ВместимостьПаллета) + " собрано в паллет");
		СтрокаНумерацииУпакованных = Строка(КоличествоУпакованных) + " из " + Строка(ВместимостьПаллета) + " собрано в паллет";
		//Сообщить(Строка(КоличествоУпакованных) + " из " + Строка(ВместимостьПаллета) + " собрано в паллет");
		
		//проверяем вместимость
		ПаллетПолностьюУпакован = ПолучитьОтметкуЗаполненногоПаллета(ПараметрыПослеУдачногоВвода.ШКПаллета);
		Если ПаллетПолностьюУпакован = Неопределено Тогда
			Сообщить("Ошибка:Не удалось получить отметку заполненного паллета");
			Возврат;
		КонецЕсли;
		Если ПаллетПолностьюУпакован Тогда
			ОзвучитьТекст("Паллет собран и готов к отгрузке");
			ТекстПодсказки = "Упаковка в Паллет полностью завершена, все Штрихкоды коробов отсканированы";
			Возврат;
		КонецЕсли;
		
		//проверяем на упакованный ли короб
		//Если ПараметрыПослеУдачногоВвода.СколькоУжеУпакованоВПаллет+1 = БазоваяВместимостьПаллетов Тогда
		//	Сообщить("Упаковка в Паллет полностью завершена, все Штрихкоды коробов отсканированы");
		//	Возврат;
		//КонецЕсли;
		
		
		МассивСвободныхШКУпакованныхКоробов = Новый Массив;
		МассивСвободныхШКУпакованныхКоробов = ПолучитьШтрихкодыУпакованныхКоробов();
		
		Если МассивСвободныхШКУпакованныхКоробов = Неопределено Тогда
			ТекстПодсказки = "Закончились созданные упакованные короба, необходимо создать";
			Возврат;
		КонецЕсли;
		
		//Нужно передавать упакованные короба только с нужной номенклатурой
		Если ПараметрыПослеУдачногоВвода.МоноПаллет = Истина Тогда
			МассивСвободныхШКУпакованныхКоробов = ПолучитьШтрихкодыУпакованныхКоробовДляМонопаллета(ПараметрыПослеУдачногоВвода.ШтрихкодМонопаллета, ПараметрыПослеУдачногоВвода.ШКПаллета);
			Если МассивСвободныхШКУпакованныхКоробов = Неопределено Тогда
				ТекстПодсказки = "Еще не созданы упакованные короба для Монопаллета в которых есть Разрешенная номенклатура";
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыДляВводаШККороба = Новый Структура;
		ПараметрыДляВводаШККороба.Вставить("МассивСвободныхШКУпакованныхКоробов", МассивСвободныхШКУпакованныхКоробов);
		ПараметрыДляВводаШККороба.Вставить("СколькоУжеУпакованоВПаллет", ПараметрыПослеУдачногоВвода.СколькоУжеУпакованоВПаллет+1);
		ПараметрыДляВводаШККороба.Вставить("ИспользуемыйСклад", Объект.ИспользуемыйСклад);
		ПараметрыДляВводаШККороба.Вставить("ШКПаллета",ПараметрыПослеУдачногоВвода.ШКПаллета);
		ПараметрыДляВводаШККороба.Вставить("СколькоВПоследнемПаллетеВместимость",Объект.СколькоВПоследнемПаллетеВместимость);
		ПараметрыДляВводаШККороба.Вставить("ДокументОснование",Объект.ДокументОснование);
		ПараметрыДляВводаШККороба.Вставить("СтрокаНумерацииУпакованных",СтрокаНумерацииУпакованных);
		ПараметрыДляВводаШККороба.Вставить("ЗаказПокупателяСсылка",Объект.ЗаказПокупателяСсылка);
		ПараметрыДляВводаШККороба.Вставить("МоноПаллет",ПараметрыПослеУдачногоВвода.МоноПаллет);
		ПараметрыДляВводаШККороба.Вставить("ШтрихкодМонопаллета",ПараметрыПослеУдачногоВвода.ШтрихкодМонопаллета);
		ПараметрыДляВводаШККороба.Вставить("Вместимость",ПараметрыПослеУдачногоВвода.Вместимость);
		
		ОбновленныеПараметрыПослеУдачногоВвода = Новый Структура;
		ОбновленныеПараметрыПослеУдачногоВвода.Вставить("ШКПаллета",ПараметрыПослеУдачногоВвода.ШКПаллета);
		ОбновленныеПараметрыПослеУдачногоВвода.Вставить("СколькоУжеУпакованоВПаллет", ПараметрыПослеУдачногоВвода.СколькоУжеУпакованоВПаллет+1);
		ОбновленныеПараметрыПослеУдачногоВвода.Вставить("МоноПаллет",ПараметрыПослеУдачногоВвода.МоноПаллет);
		ОбновленныеПараметрыПослеУдачногоВвода.Вставить("ШтрихкодМонопаллета",ПараметрыПослеУдачногоВвода.ШтрихкодМонопаллета);
		ОбновленныеПараметрыПослеУдачногоВвода.Вставить("Вместимость",ПараметрыПослеУдачногоВвода.Вместимость);
		
		Оповещение = Новый ОписаниеОповещения("ПослеВводаШККоробаДляПаллета", ЭтотОбъект, ОбновленныеПараметрыПослеУдачногоВвода);
		ОткрытьФорму("Обработка.УпаковкаВПаллеты.Форма.ВводКороба", ПараметрыДляВводаШККороба, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		// Пользователь нажал Отмена или закрыл диалог
		ТекстПодсказки = "Упаковка в паллет отменена";
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьРСУпакованныеКороба(ШККороба, ШКПаллета)
	
	Если ШККороба = "" Или ШККороба = Неопределено Тогда
		Сообщить("Ошибка: не указан штрихкод короба");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпакованныеКороба.Период КАК Период,
	|	УпакованныеКороба.ДокументОснование КАК ДокументОснование,
	|	УпакованныеКороба.ШККороба КАК ШККороба,
	|	УпакованныеКороба.ШКПаллета КАК ШКПаллета
	|ИЗ
	|	РегистрСведений.УпакованныеКороба КАК УпакованныеКороба
	|ГДЕ
	|	УпакованныеКороба.ДокументОснование = &ДокументОснование
	|	И УпакованныеКороба.ШККороба = &ШККороба";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
	Запрос.УстановитьПараметр("ШККороба", ШККороба);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// 2. Обновляем найденные записи через набор записей
	Если Выборка.Следующий() Тогда
		НаборЗаписей = РегистрыСведений.УпакованныеКороба.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументОснование.Установить(Выборка.ДокументОснование);
		НаборЗаписей.Отбор.ШККороба.Установить(Выборка.ШККороба);
		НаборЗаписей.Прочитать();
		
		Для каждого Запись Из НаборЗаписей Цикл
			Запись.ШКПаллета = ШКПаллета;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		ТекстПодсказки = "Статус обновлен для упакованного короба: " + ШККороба;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРСШтрихкодыПаллетов(ШКПаллета, КоличествоУпакованных)
	
	Если ШКПаллета = "" Или ШКПаллета = Неопределено Тогда
		Сообщить("Ошибка: не указан штрихкод паллета");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыПаллетов.Период КАК Период,
	|	ШтрихкодыПаллетов.ДокументОснование КАК ДокументОснование,
	|	ШтрихкодыПаллетов.ШтрихкодПаллета КАК ШтрихкодПаллета,
	|	ШтрихкодыПаллетов.ПолностьюУпакован КАК ПолностьюУпакован,
	|	ШтрихкодыПаллетов.СколькоУпаковано КАК СколькоУпаковано,
	|	ШтрихкодыПаллетов.Вместимость КАК Вместимость
	|ИЗ
	|	РегистрСведений.ШтрихкодыПаллетов КАК ШтрихкодыПаллетов
	|ГДЕ
	|	ШтрихкодыПаллетов.ДокументОснование = &ДокументОснование
	|	И ШтрихкодыПаллетов.ШтрихкодПаллета = &ШтрихкодПаллета";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
	Запрос.УстановитьПараметр("ШтрихкодПаллета", ШКПаллета);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// 2. Обновляем найденные записи через набор записей
	Если Выборка.Следующий() Тогда
		НаборЗаписей = РегистрыСведений.ШтрихкодыПаллетов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументОснование.Установить(Выборка.ДокументОснование);
		НаборЗаписей.Отбор.ШтрихкодПаллета.Установить(Выборка.ШтрихкодПаллета);
		НаборЗаписей.Прочитать();
		
		Для каждого Запись Из НаборЗаписей Цикл
			Запись.СколькоУпаковано = КоличествоУпакованных;
			Если КоличествоУпакованных = Выборка.Вместимость Тогда
				Запись.ПолностьюУпакован = Истина;
			КонецЕсли;
			Если Выборка.Вместимость <> Объект.БазоваяВместимостьПаллетов И КоличествоУпакованных = Объект.СколькоВПоследнемПаллетеВместимость Тогда
				Запись.ПолностьюУпакован = Истина;
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		ТекстПодсказки = "Статус обновлен для паллета: " + ШКПаллета;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОтметкуЗаполненногоПаллета(ШКПаллета)
	
	Если ШКПаллета = "" Или ШКПаллета = Неопределено Тогда
		Сообщить("Ошибка: не указан штрихкод паллета");
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыПаллетов.ПолностьюУпакован КАК ПолностьюУпакован
	|ИЗ
	|	РегистрСведений.ШтрихкодыПаллетов КАК ШтрихкодыПаллетов
	|ГДЕ
	|	ШтрихкодыПаллетов.ДокументОснование = &ДокументОснование
	|	И ШтрихкодыПаллетов.ШтрихкодПаллета = &ШтрихкодПаллета";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
	Запрос.УстановитьПараметр("ШтрихкодПаллета", ШКПаллета);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// 2. Обновляем найденные записи через набор записей
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПолностьюУпакован;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции


&НаСервере
Функция ПолучитьВместимостьПаллета(ШКПаллета)
	
	Если ШКПаллета = "" Или ШКПаллета = Неопределено Тогда
		Сообщить("Ошибка: не указан штрихкод паллета");
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыПаллетов.Вместимость КАК Вместимость
	|ИЗ
	|	РегистрСведений.ШтрихкодыПаллетов КАК ШтрихкодыПаллетов
	|ГДЕ
	|	ШтрихкодыПаллетов.ДокументОснование = &ДокументОснование
	|	И ШтрихкодыПаллетов.ШтрихкодПаллета = &ШтрихкодПаллета";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
	Запрос.УстановитьПараметр("ШтрихкодПаллета", ШКПаллета);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// 2. Обновляем найденные записи через набор записей
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Вместимость;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ПовторнаяПечатьШКПаллета(Команда)//ШКПаллета
	// 1. Проверяем, что выделена хотя бы одна строка
    Если Не Объект.Паллеты.Количество() > 0 И Не Элементы.Паллеты.ТекущаяСтрока = Неопределено Тогда
        ТекстПодсказки = "Выделите строку паллета для начала работы.";
        Возврат;
    КонецЕсли;

    // 2. Получаем данные выделенной строки
    ТекущаяСтрока = Элементы.Паллеты.ТекущиеДанные;
	ПечатьКМ(ТекущаяСтрока.ШКПаллета);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтруктуруДереваПаллета(Команда)
	
	// 1. Проверяем, что выделена хотя бы одна строка
	Если Не Объект.Паллеты.Количество() > 0 И Не Элементы.Паллеты.ТекущаяСтрока = Неопределено Тогда
		ТекстПодсказки = "Выделите строку паллета для начала работы.";
		Возврат;
	КонецЕсли;
	
	// 2. Получаем данные выделенной строки
	ТекущаяСтрока = Элементы.Паллеты.ТекущиеДанные;
	
	
	ПараметрыДляДерева = Новый Структура;
	ПараметрыДляДерева.Вставить("ДокументОснование",Объект.ДокументОснование);
	ПараметрыДляДерева.Вставить("ЗаказПокупателяСсылка",Объект.ЗаказПокупателяСсылка);
	ПараметрыДляДерева.Вставить("Контрагент",Объект.Контрагент);
	ПараметрыДляДерева.Вставить("ИспользуемыйСклад", Объект.ИспользуемыйСклад);
	ПараметрыДляДерева.Вставить("ШКПаллета",ТекущаяСтрока.ШКПаллета);
	ПараметрыДляДерева.Вставить("ШтрихкодМонопаллета",ТекущаяСтрока.ШтрихкодМонопаллета);
	
	ПараметрыПослеЗакрытияСтруктуры = Новый Структура;
	ПараметрыПослеЗакрытияСтруктуры.Вставить("ШКПаллета",ТекущаяСтрока.ШКПаллета);
	
	//Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыДерева", ЭтотОбъект, ПараметрыПослеЗакрытияСтруктуры);
	//ОткрытьФорму("Обработка.УпаковкаВПаллеты.Форма.ФормаДерева", ПараметрыДляДерева, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ОткрытьФорму("Обработка.УпаковкаВПаллеты.Форма.ФормаДерева", ПараметрыДляДерева, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОзвучитьТекст(ТекстДляОзвучки)
	
	Попытка
		// 1. Создаем COM-объект голосового движка Windows
		Голос = Новый COMОбъект("SAPI.SpVoice");
		
		// Пример для голоса "Pavel" из Windows 10/11
		Голос.Voice = Голос.GetVoices().Item(0); // Первый доступный голос
		// Или указать конкретный из реестра:
		// Голос.Voice.Category.Default = "HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Speech_OneCore\Voices\Tokens\MSTTS_V110_ruRU_PavelM";
		
		//// берем последний
		//Для Индекс = 0 По Голос.GetVoices().Count - 1 Цикл
		//	Голос.Voice = Голос.GetVoices().Item(Индекс);
		//КонецЦикла;
		
		// 2. Устанавливаем громкость (0 - 100)
		Голос.Volume = 100;
		
		// 3. Выбираем скорость речи (-10 - 10). 0 - средняя
		Голос.Rate = 0;
		
		// 4. Произносим текст
		Голос.Speak(ТекстДляОзвучки);
		
	Исключение
		Сообщить("Не удалось воспроизвести речь: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

///////////////////////////////////ПЕЧАТЬ/////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ПечатьКМ(ВведенныйШтрихкод)
	
	Если Не ЗначениеЗаполнено(ВведенныйШтрихкод) Тогда
		Сообщить("Введите штрихкод");
		Возврат;
	КонецЕсли;
	
	// Поиск упаковки по штрихкоду на сервере
	НайденнаяУпаковка = ПоискУпаковкиПоШтрихкодуНаСервере(ВведенныйШтрихкод);
	
	Если НайденнаяУпаковка = "" Тогда
		Сообщить("Упаковка со штрихкодом """ + ВведенныйШтрихкод + """ не найдена");//убрать в сообщение
		Возврат;
	КонецЕсли;
	
	// Получаем шаблон этикетки из справочника ХранилищеШаблонов
	ШаблонЭтикетки = ПолучитьШаблонЭтикеткиНаСервере();
	
	Если ШаблонЭтикетки = "" Тогда
		Сообщить("Не найден шаблон этикетки");
		Возврат;
	КонецЕсли;
	
	// Формируем описание команды для печати
	ОписаниеКоманды = Новый Структура;
	ОписаниеКоманды.Вставить("Идентификатор", "ЭтикеткаКодМаркировкиИСМП");
	ОписаниеКоманды.Вставить("ОбъектыПечати", Новый Массив);
	ОписаниеКоманды.ОбъектыПечати.Добавить(НайденнаяУпаковка);
	ОписаниеКоманды.Вставить("Форма", ЭтаФорма); 
	ОписаниеКоманды.Вставить("ШаблонЭтикетки", ШаблонЭтикетки);
	
	// Получаем данные для печати
	ОбъектыПечати = ПечатьЭтикетокИСМПВызовСервера.ДанныеДляПечатиШтрихкодовУпаковокИСМП(
		ОписаниеКоманды.Идентификатор,
		ОписаниеКоманды.ОбъектыПечати,
		Новый Массив()); // МассивШаблоновКодовМаркировок сразу создаем
	
	Если ОбъектыПечати.Количество() = 0 Тогда
		Сообщить(НСтр("ru='Нет данных для печати этикеток.'"));
		Возврат;
	КонецЕсли;
	
	// Формируем параметры открытия формы
	ПараметрыОткрытия = Новый Структура(
		"АдресВХранилище, Шаблоны", 
		ПоместитьВоВременноеХранилище(Новый Структура("РежимПечати, ОбъектыПечати", "Выборочно", ОбъектыПечати)),
		Новый Массив());
		
		
	ПараметрыОткрытия.Вставить("СразуНаПринтер", Истина);
	ПараметрыОткрытия.Вставить("ШаблонЭтикетки", ШаблонЭтикетки);
	// Открываем форму
	//ОткрытьФорму("Справочник.ШаблоныЭтикетокИЦенников.Форма.ФормаШтрихкодыЭтикетокИСМП", ПараметрыОткрытия, ЭтаФорма);
	
	
	ДанныеП = выполнитьПечатьНаСервере(ПараметрыОткрытия);
	ВыполнитьПечатьДока(ДанныеП,ВведенныйШтрихкод);
КонецПроцедуры

&НаСервере
Функция выполнитьПечатьНаСервере(ПараметрыОткрытия)
	СразуНаПринтер        = ПараметрыОткрытия.СразуНаПринтер;
	КоличествоЭкземпляров = 1;
	ШаблонЭтикетки        = ПараметрыОткрытия.ШаблонЭтикетки;
	
	Если ЗначениеЗаполнено(ПараметрыОткрытия.АдресВХранилище) Тогда
	АдресВХранилище = ПоместитьВоВременноеХранилище(
		ПолучитьИзВременногоХранилища(ПараметрыОткрытия.АдресВХранилище),
		УникальныйИдентификатор);
	КонецЕсли;
	
	ДанныеПечати = ПолучитьИзВременногоХранилища(АдресВХранилище);
	Для Каждого СтрокаПечати Из ДанныеПечати.ОбъектыПечати Цикл
		СтрокаПечати.ШаблонЭтикетки = ШаблонЭтикетки;
	КонецЦикла;
	
	Возврат ДанныеПечати;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПечатьДока(ДанныеП,ВведенныйШтрихкод)
	
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка"));
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("КоличествоЭкземпляров", 1);//не нужна структура вообще, здесь формируем по своему отдельно в вызове печати
	ПараметрыПечати.Вставить("СтруктураДанных", ДанныеП);
	ПараметрыПечати.Вставить("АдресВХранилище", "");
	ПараметрыПечати.Вставить("КаждаяЭтикеткаНаНовомЛисте", Истина);
	ПараметрыПечати.Вставить("СразуНаПринтер", Истина);
	ПараметрыПечати.Вставить("РежимПечати", "ЭтикеткаКодМаркировкиИСМП"); 
	////////////////далее для ЭтикеткаШтрихкодыУпаковки
	
	
	//ЕСЛИ ПЕЧАТЬ ШТРИХКОДА УПАКОВКИ
	//Если КонстантаПечататьСразуНаПринтер() Тогда
	//	//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Обработка.ПечатьЭтикетокИЦенников", "ЭтикеткаДляШтрихкодовУпаковок", ПараметрКоманды, ПараметрыПечати);
	//	УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Обработка.ПечатьЭтикетокИЦенников","ЭтикеткаШтрихкодыУпаковки",ПараметрКоманды, ПолучитьПараметрыДляШтрихкодовУпаковок(ВладелецФормы.УникальныйИдентификатор,ВведенныйШтрихкод));

	//Иначе
	//	//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьЭтикетокИЦенников","ЭтикеткаДляШтрихкодовУпаковок",ПараметрКоманды,ВладелецФормы,ПараметрыПечати);
	//	////////////////////////////////////////////////////////////
	//	//ПараметрКоманды = Новый Массив;
	//	//ПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка"));
	//
	//	//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьЭтикетокИЦенников","ЭтикеткаШтрихкодыУпаковки",ПараметрКоманды,ВладелецФормы,ПолучитьПараметрыДляШтрихкодовУпаковок(ВладелецФормы.УникальныйИдентификатор));
	//	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьЭтикетокИЦенников","ЭтикеткаШтрихкодыУпаковки",ПараметрКоманды, ВладелецФормы, ПолучитьПараметрыДляШтрихкодовУпаковок(ВладелецФормы.УникальныйИдентификатор,ВведенныйШтрихкод));
	//
	//	////////////////////////////////////////////////////////////
	//КонецЕсли; 
	
	
	
	Если КонстантаПечататьСразуНаПринтер() Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Обработка.ПечатьЭтикетокИЦенников", "ЭтикеткаКодМаркировкиИСМП", ПараметрКоманды, ПараметрыПечати);
	Иначе
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьЭтикетокИЦенников","ЭтикеткаКодМаркировкиИСМП",ПараметрКоманды,ВладелецФормы,ПараметрыПечати);
	КонецЕсли;
	
	
КонецПроцедуры
///////////////////////////////////////////////////////////
&НаСервере
Функция ПолучитьПараметрыДляШтрихкодовУпаковок(ИдентификаторВладельца,ВведенныйШтрихкод)
	
	ПараметрыПечати = Новый Структура;
	ШтрихкодыУпаковок = Новый ТаблицаЗначений;
	// Добавляем колонки
	ШтрихкодыУпаковок.Колонки.Добавить("ДатаМаркировки", Новый ОписаниеТипов("Дата"));
	ШтрихкодыУпаковок.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ШтрихкодыУпаковок.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));
	ШтрихкодыУпаковок.Колонки.Добавить("ТипШтрихкода", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыШтрихкодов"));
	ШтрихкодыУпаковок.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
	ШтрихкодыУпаковок.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ШтрихкодыУпаковок.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка"));

	// Создаем строку
	СтрокаТаблицы = ШтрихкодыУпаковок.Добавить();

	// Заполняем значения (имитация данных)
	СтрокаТаблицы["ДатаМаркировки"] = '00010101'; // Пустая дата
	СтрокаТаблицы["Номенклатура"] = Справочники.Номенклатура.ПустаяСсылка();
	СтрокаТаблицы["Ссылка"] = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода",ВведенныйШтрихкод);
	СтрокаТаблицы["ТипШтрихкода"] = Перечисления.ТипыШтрихкодов.SSCC;
	СтрокаТаблицы["Упаковка"] = Неопределено; // Пустая ссылка
	СтрокаТаблицы["Характеристика"] = Неопределено; // Пустая ссылка
	СтрокаТаблицы["Штрихкод"] = ВведенныйШтрихкод;
	
	ПараметрыПечати.Вставить("ИсходныеДанные", ЗначениеВСтрокуВнутр(ШтрихкодыУпаковок));
	//ПараметрыПечати.Вставить("ИсходныеДанные", ЗначениеВСтрокуВнутр(ШтрихкодыУпаковок.Выгрузить()));
	ПараметрыПечати.Вставить("ШаблонЭтикетки",ПолучитьШаблонЭтикеткиНаСервере());
	ПараметрыПечати.Вставить("КоличествоЭкземпляров", 1);
	ПараметрыПечати.Вставить("СтруктураМакетаШаблона", Неопределено);
	ПараметрыПечати.Вставить("РежимПечати", "ЭтикеткаКодМаркировкиИСМП");
	
	Возврат ПараметрыПечати;
	
КонецФункции
//////////////////////////////////////////////////////////////
&НаСервере
Функция КонстантаПечататьСразуНаПринтер()
	Возврат Константы.БИТ_ОтправкаПечатиКМКИНУШКсразуНаПринтер.Получить();
КонецФункции

&НаСервере
Функция ПоискУпаковкиПоШтрихкодуНаСервере(Знач ВведенныйШтрихкод)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ЗначениеШтрихкода
		|	ИЛИ ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ЗначениеШтрихкодаУпаковки";
	
	Запрос.УстановитьПараметр("ЗначениеШтрихкода", ВведенныйШтрихкод);
	Запрос.УстановитьПараметр("ЗначениеШтрихкодаУпаковки", ВведенныйШтрихкод);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции  

&НаСервере
Функция ПолучитьШаблонЭтикеткиНаСервере()
	
	// Ищем шаблон по имени или типу
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ХранилищеШаблонов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХранилищеШаблонов КАК ХранилищеШаблонов
		|ГДЕ
		|	ХранилищеШаблонов.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", "Паллет");
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	
	// Если не нашли, возвращаем пустую строку
	Возврат "";
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    // Устанавливаем обработчик ожидания, который сработает через 1 секунду
    WSHShell = Новый COMОбъект("WScript.Shell");
    WSHShell.SendKeys("% ");
    WSHShell.SendKeys("{DOWN}{DOWN}{DOWN}{DOWN}{ENTER}");
	ОграниченияПросмотраДляЗоныУпаковки();
КонецПроцедуры

&НаСервере
Процедура ОграниченияПросмотраДляЗоныУпаковки()
	//ТекущийСотрудник = ПараметрыСеанса.ТекущийСотрудник; 
	ТекущийСотрудник = ПолучитьТекущегоСотрудника();
	Если ТекущийСотрудник = Справочники.Сотрудники.ПустаяСсылка() Тогда
		Сообщить("Не найден сотрудник в справочнике!");
		Возврат;
	КонецЕсли;
	
	ЕстьПраваАдминистратора = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыДоступа.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|ГДЕ
	|	ГруппыДоступа.Наименование = ""Администраторы""
	|	И ГруппыДоступа.Пользователи.Пользователь.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Пользователи.ТекущийПользователь());
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ЕстьПраваАдминистратора = Истина;
	КонецЕсли;
	
	Если Не ЕстьПраваАдминистратора Тогда
		СтруктураОтбора = Новый ФиксированнаяСтруктура("ОтветственнаяЗона", ТекущийСотрудник);
		Элементы.Паллеты.ОтборСтрок = СтруктураОтбора;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущегоСотрудника()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО Сотрудники.Физлицо = Пользователи.ФизическоеЛицо
	|ГДЕ
	|	Пользователи.Ссылка = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Сотрудник;
	КонецЕсли;
	
КонецФункции
